
// # Homework

// 1. .forEach

// მასივი: ['ვაშლი', 'მსხალი', 'ატამი']

// მიზანი: forEach-ით გამოიტანე კონსოლში ტექსტი ასეთი ფორმატით: "0: ვაშლი", "1: მსხალი" და ა.შ.
fruits =  ['ვაშლი', 'მსხალი', 'ატამი']
console.log(fruits.forEach((items, index) =>{
    console.log(`${items}  ${index}`)
}))

// 2. მასივი: [1, 2, 3, 4, 5, 6]

// მიზანი: forEach-ით შეამოწმე თითოეული რიცხვი. თუ ლუწია, კონსოლში დაწერე "ლუწია", თუ კენტია — "კენტია"
nums =  [1, 2, 3 ,4 ,5, 6]
console.log(nums.forEach(items =>{
    if(items % 2 == 0){
        console.log(`${items} even`)
    }
    else{
        console.log(`${items} odd`)
    }
}))

// 3. .map

// მასივი: [100, 250, 50, 80] (ფასები ლარებში)მიზანი: map-ით შექმენი ახალი მასივი, სადაც თითოეულ ფასს დაკლებული ექნება 

// 10%.ფორმულა: price * 0.9.
const masivi =  [100, 250, 50, 80]
console.log(masivi.map((items) =>{
    return items * 0.9
}))
// 4. .some

// მასივი: ['სახლი', 'გზა', 'ავტომობილი', 'ხე']

// მიზანი: შეამოწმე, არის თუ არა მასივში თუნდაც ერთი სიტყვა, რომლის სიგრძე 10 სიმბოლოზე მეტია.
var list =  ['სახლი', 'გზა', 'ავტომობილი', 'ხე']
console.log(list.some((items) =>{
    return items.length> 10
}))
// 5. .find

// მოცემულობა: გაქვს რიცხვების მასივი: [5, 12, 8, 130, 44].

// მიზანი: იპოვე ამ მასივში პირველივე რიცხვი, რომელიც მეტია 10-ზე.
let let1 = [5, 12, 8, 130, 44]
console.log(let1.find((items) =>{
    return items > 10
}))
// 6. .findIndex

// მოცემულობა: გაქვს მასივი: ['ვაშლი', 'ბანანი', 'ფორთოხალი', 'ატამი'].

// მიზანი: გაიგე, რა ინდექსზე იმყოფება სიტყვა 'ფორთოხალი'.
let let21 =  ['ვაშლი', 'ბანანი', 'ფორთოხალი', 'ატამი']
console.log(let21.findIndex((items) =>{
    return 'ფორთოხალი'
}))
// 7. .reduce

// მასივი: ['მე', 'მიყვარს', 'JavaScript']

// მიზანი: reduce-ით შეაერთე ეს სიტყვები ერთ გრძელ სტრინგად, მათ შორის ჰქონდეს გამოტოვება (space).
let let21q =  ['მე', 'მიყვარს', 'JavaScript ']
console.log(let21q.reduce((items) =>{
    return items
}))

// მოსალოდნელი შედეგი: "მე მიყვარს JavaScript".

// 8. დაასრულეთ საკლასო ვისაც არ დაგისრულებიათ.


// # Homework

// 1. .forEach

// მასივი: ['ვაშლი', 'მსხალი', 'ატამი']

// მიზანი: forEach-ით გამოიტანე კონსოლში ტექსტი ასეთი ფორმატით: "0: ვაშლი", "1: მსხალი" და ა.შ.
fruits =  ['ვაშლი', 'მსხალი', 'ატამი']
console.log(fruits.forEach((items, index) =>{
    console.log(`${items}  ${index}`)
}))

// 2. მასივი: [1, 2, 3, 4, 5, 6]

// მიზანი: forEach-ით შეამოწმე თითოეული რიცხვი. თუ ლუწია, კონსოლში დაწერე "ლუწია", თუ კენტია — "კენტია"
nums =  [1, 2, 3 ,4 ,5, 6]
console.log(nums.forEach(items =>{
    if(items % 2 == 0){
        console.log(`${items} even`)
    }
    else{
        console.log(`${items} odd`)
    }
}))

// 3. .map

// მასივი: [100, 250, 50, 80] (ფასები ლარებში)მიზანი: map-ით შექმენი ახალი მასივი, სადაც თითოეულ ფასს დაკლებული ექნება 

// 10%.ფორმულა: price * 0.9.
const masivi =  [100, 250, 50, 80]
console.log(masivi.map((items) =>{
    return items * 0.9
}))
// 4. .some

// მასივი: ['სახლი', 'გზა', 'ავტომობილი', 'ხე']

// მიზანი: შეამოწმე, არის თუ არა მასივში თუნდაც ერთი სიტყვა, რომლის სიგრძე 10 სიმბოლოზე მეტია.
var list =  ['სახლი', 'გზა', 'ავტომობილი', 'ხე']
console.log(list.some((items) =>{
    return items.length> 10
}))
// 5. .find

// მოცემულობა: გაქვს რიცხვების მასივი: [5, 12, 8, 130, 44].

// მიზანი: იპოვე ამ მასივში პირველივე რიცხვი, რომელიც მეტია 10-ზე.
let let1 = [5, 12, 8, 130, 44]
console.log(let1.find((items) =>{
    return items > 10
}))
// 6. .findIndex

// მოცემულობა: გაქვს მასივი: ['ვაშლი', 'ბანანი', 'ფორთოხალი', 'ატამი'].

// მიზანი: გაიგე, რა ინდექსზე იმყოფება სიტყვა 'ფორთოხალი'.
let let21 =  ['ვაშლი', 'ბანანი', 'ფორთოხალი', 'ატამი']
console.log(let21.findIndex((items) =>{
    return 'ფორთოხალი'
}))
// 7. .reduce

// მასივი: ['მე', 'მიყვარს', 'JavaScript']

// მიზანი: reduce-ით შეაერთე ეს სიტყვები ერთ გრძელ სტრინგად, მათ შორის ჰქონდეს გამოტოვება (space).
let let21q =  ['მე', 'მიყვარს', 'JavaScript ']
console.log(let21q.reduce((items) =>{
    return items
}))

// მოსალოდნელი შედეგი: "მე მიყვარს JavaScript".

// 8. დაასრულეთ საკლასო ვისაც არ დაგისრულებიათ.


// 9. გადახედეთ ჩანაწერს