// 1)ახსენით ეს მეთოდები კომენტარებით და მოიყვანეთ 2-2 მაგალითი თითოეულზე:
// .length - ამოწმებს რამდენი ელემენტით და სიმბოლით შედგება მონაცემთა ტიპი - console.log("helloworld".length()) = 10 - console.log
// .join() - აერთებს სტრინგებს ერთად - console.log(['lemon', 'orange', 'apple'].join("   "))  = lemon   orange   apple 
// .toString() - ლისტს აქცევს ერთ სტრინგად მაგ. console.log([1, 2, 3, 4, 5].toString()) ="1,2,3,4,5" console.log(["1", 4, 7] ) = "147"
// .pop() - ამოიღებს ბოლო ობიექტს არრაიში მაგ. console.log([1,2,3,4,5,6].pop()) = 6  console.log([1,2,3, "eh", "undefined"].pop()) = undefined
// .push() - იგივე როგორ პოპ
// .shift() - შლის პირველ ნივთს სიაში
// Array.isArray(); - ამოწმებს თუ არის არრაი
// .concat() - აერთებს ორ ლისტს
// .slice() - ამოჭრის ლისტის ნაწილს
// .splice() - ანაცვლებს ლისტში ახალი რაღაცით ან უბრალოდ ამატებს
// დავალება 2: შეასწორე Scope Pollution (დაბინძურება)
// ქვემოთ მოცემულ კოდში ფუნქცია changePrice შემთხვევით ცვლის გლობალურ ფასს. შეასწორე კოდი ისე, რომ ფუნქციამ შექმნას საკუთარი ლოკალური ცვლადი და არ შეეხოს გლობალურს.

let price = 100;

const changePrice = () => {
    let price = 50; 
    console.log("ახალი ფასი ფუნქციაში:", price);
};

changePrice();
console.log("გლობალური ფასი:", price); // აქ ისევ 100 უნდა ეწეროს!

// ----------------------------------------------------------------------------------------------------------------

// დავალება 3: პარამეტრები და Scope
// ფუნქციის პარამეტრებიც ლოკალური სკოუპის ნაწილია. გამოიცანი შედეგი:


let hero = "Batman";

function transform(hero) {
    hero = "Superman";
    console.log("ფუნქციის შიგნით:", hero);
}

transform("Iron Man");
console.log("გარეთ:", hero);
// კითხვა: რატომ არ შეიცვალა გლობალური hero Superman-ით? და რა როლი ითამაშა აქ "Iron Man"-მა?