# 0) ახსენით რა განსხვავებაა listსა და setს შორის

# 1) ჩამოწერეთ და ახსენით setის ფუნქციები

# 2) რა არის dictionary?

# 3) ჩამოოწერეთ და ახსენით dictionaryს ფუნქციები

# 4) შექმენით set და dictionary, შემდეგ კი გამოიყენეთ მათზე 2-2 ნებისმიერი ფუნქცია


# 1) listსა და setის განსხვავება არის. set არის უნორდერედი და setში დუპლიკატების შენახვა შეგვლილა პლიუს listში შეგვილია indexინგი გამოვიყენოთ,
# სეტში არა


# 2) set-ის ფუნქციები ახსნით - ჩამოწერით.

# .add() ამატებს ბრჩხილებში მოცემულ ალემენტს
# .clear() შლის მთლიან setს
# .remove() შლის ბრჩხილებში მოცემულ ალემენტს

# 3)
# dictionary არის setი მაგრამ ელემენტების მაგივრად კეის და მნიშმნელობას ვუწერთ.

# 4)
# .items = ყველაფერს იტანს მაგრამ თუპლის სტილით.
# .keys = გაომიტანს დიქშინარის ქეიებს.
# .get = ()-ში გადაეცემა რაცღაცა გასაღები და დიქშინარიდან .გვიბრუნებს მნიშმნელობას
# .values = ვარიუბლებს და კეიებს გამოიტანს დიქშინარიდან
 
# 5)
set = {1, 2, 3, "mtredi"}
dict = {
   "key" : "huh",
   "hi" : "hello",
   "friends" : ["hey", "hello"]
}


set.add(6)
set.remove("mtredi")
set.clear()

dict.values("key")
dict.keys()
dict.items()
dict.get("friends")