// # Classwork

// 1. შექმენი ობიექტი სახელით store, რომელსაც ექნება შემდეგი თვისებები:

// apples: 15

// bananas: 13

// oranges: 14

// დაამატე მეთოდი applyDiscount, რომელიც არგუმენტად მიიღებს პროცენტს (მაგალითად, 10 ნიშნავს 10 ლარის ფასდაკლებას).

// გამოიყენე ციკლი: მეთოდის შიგნით გამოიყენე for...in ციკლი, რათა გადაუარო ობიექტის ყველა პროდუქტს.

// შეცვალე მნიშვნელობა: ციკლის დახმარებით თითოეულ პროდუქტს გამოაკელი შესაბამისი პროცენტი და განაახლე მნიშვნელობა ობიექტში.

// გამოიძახე მეთოდი: დააკონსოლე ობიექტი მეთოდის გამოძახებამდე და გამოძახების შემდეგ, რათა დარწმუნდე, რომ ფასები შეიცვალა.
let store = {
    apples: 15,
    bananas: 13,
    oranges: 14,
    func: () =>{

    }

}
store.applyDiscount = 10
for(i in obj){
    console.log(i)


}
console.log(store)