# 0) კომენტარებით დაწერეთ ყველა control flowს ტექნიკა
# sequencing - თანმიმდევრობა მაგ. მათემატიკაში პირველი ()-ის მოქმედებას რომ აკეთებ.
# selection - არჩევანი მაგ. True or False
# iteration - ერთიდა იგივე მოქმედების 2-ჯერ ან მეტ ჯერ გაკეთება

# 1) კომენტარებით დაწერეთ რა არის ალგორითმი
# ალგორითმი არის ეტაპ ეტაპ დავალების გაკეთება.

# 2) კომენტარებით ახსენით რა არის საიტერაციო ცვლადი
# საიტერაცო ცვლადი არის თამიმდევრობა მაგ. for i in range(10, 20) i არის საიტერაციო ცვლადი რადგან მას აქვს რიცხვების მნიშვნელობა 10 დან 20-ამდე
# 3) დაწერეთ კოდი for ციკლით, რომლითაც გამოიტანთ თქვენს სახელს 10-ჯერ და თქვენს ასაკს 20-ჯერ