<<<<<<< HEAD
//  forEach. ამითი ჩვენ შეგიძლია გადაროთ მასივს და გამოვიტანოთ თითუეული ელემენტი, ინდექსები, თვითონ მასივი.

// .some ეს ფუნქცია შეგვიძლია გავიგოთ თუ ამ მასივიდან რომელიმე ელემენტი აკმაყოფილებს პირობას. თუ აკმაყფილებს პირობას მაშინ გამოიტანს ტრუს თუ არა მაშინ ფალსს

// .fillter მასივიდან ფილტრავს ელემენტებს

// .map ყველა ელემენტზე აკეთებს ერთ მოქმედებას

// 2. .forEach

// მოცემულობა: გაქვს სახელების მასივი: ['ანა', 'ნიკა', 'გიორგი'].

// მიზანი: forEach-ის გამოყენებით, კონსოლში გამოიტანე თითოეული სახელი მისალმებასთან ერთად.

// 3. .map 

// მოცემულობა: გაქვს მასივი: [2, 4, 6, 8].

// მიზანი: map-ის გამოყენებით შექმენი ახალი მასივი, სადაც თითოეული რიცხვი გამრავლებული იქნება 2-ზე.

// 4. .filter 

// მოცემულობა: გაქვს ასაკების მასივი: [12, 25, 17, 30, 15].

// მიზანი: filter-ის გამოყენებით შექმენი ახალი მასივი, რომელშიც მხოლოდ 18 წლის ან უფროსი ასაკის რიცხვები მოხვდება.

// 5. .some

// მოცემულობა: გაქვს მასივი: [5, 8, -2, 10].

// მიზანი: some-ის გამოყენებით გაარკვიე, არის თუ არა მასივში თუნდაც ერთი უარყოფითი (0-ზე ნაკლები) რიცხვი.

// მოცემულობა: გაქვს მასივი: [5, 8, -2, 10].

// მიზანი: some-ის გამოყენებით გაარკვიე, არის თუ არა მასივში თუნდაც ერთი უარყოფითი (0-ზე ნაკლები) რიცხვი.
var nums = [5, 8,-2,10]
const num1 = nums.some((items) =>{
    return items < 0
})
console.log(num1)

var list= [12, 25, 17, 30,]

const listed = list.filter((items) =>{
    return items >= 18
})



var list9 =  [2, 4, 6,8] 
console.log(list9.map((items) => {
    return items*2
}))
var list9 =  [2, 4, 6,8] 
console.log(list9.forEach((items) => {
    return "hello "+items
}))

=======
//  forEach. ამითი ჩვენ შეგიძლია გადაროთ მასივს და გამოვიტანოთ თითუეული ელემენტი, ინდექსები, თვითონ მასივი.

// .some ეს ფუნქცია შეგვიძლია გავიგოთ თუ ამ მასივიდან რომელიმე ელემენტი აკმაყოფილებს პირობას. თუ აკმაყფილებს პირობას მაშინ გამოიტანს ტრუს თუ არა მაშინ ფალსს

// .fillter მასივიდან ფილტრავს ელემენტებს

// .map ყველა ელემენტზე აკეთებს ერთ მოქმედებას

// 2. .forEach

// მოცემულობა: გაქვს სახელების მასივი: ['ანა', 'ნიკა', 'გიორგი'].

// მიზანი: forEach-ის გამოყენებით, კონსოლში გამოიტანე თითოეული სახელი მისალმებასთან ერთად.

// 3. .map 

// მოცემულობა: გაქვს მასივი: [2, 4, 6, 8].

// მიზანი: map-ის გამოყენებით შექმენი ახალი მასივი, სადაც თითოეული რიცხვი გამრავლებული იქნება 2-ზე.

// 4. .filter 

// მოცემულობა: გაქვს ასაკების მასივი: [12, 25, 17, 30, 15].

// მიზანი: filter-ის გამოყენებით შექმენი ახალი მასივი, რომელშიც მხოლოდ 18 წლის ან უფროსი ასაკის რიცხვები მოხვდება.

// 5. .some

// მოცემულობა: გაქვს მასივი: [5, 8, -2, 10].

// მიზანი: some-ის გამოყენებით გაარკვიე, არის თუ არა მასივში თუნდაც ერთი უარყოფითი (0-ზე ნაკლები) რიცხვი.

// მოცემულობა: გაქვს მასივი: [5, 8, -2, 10].

// მიზანი: some-ის გამოყენებით გაარკვიე, არის თუ არა მასივში თუნდაც ერთი უარყოფითი (0-ზე ნაკლები) რიცხვი.
var nums = [5, 8,-2,10]
const num1 = nums.some((items) =>{
    return items < 0
})
console.log(num1)

var list= [12, 25, 17, 30,]

const listed = list.filter((items) =>{
    return items >= 18
})



var list9 =  [2, 4, 6,8] 
console.log(list9.map((items) => {
    return items*2
}))
var list9 =  [2, 4, 6,8] 
console.log(list9.forEach((items) => {
    return "hello "+items
}))

>>>>>>> 0f2c4d82c453c6f0f6cf5f90acb45cf0461dee3d
