//  #Classwork
// 1) მოიძიეთ ინფორმაცია Ternary Operatorზე

// 2) ახსენით რა განსხვავებაა ტერნარი ოპერატორსა და ჩვეულებრივ ifelse შორის 

// 3) Ternary Operator დახმარებით შეამოწმეთ userAge არის თუ არა სრულწლოვანი


// thernary opertatorი იგივე როგორც else if მაგრამ მისი ჩაწერა კოდში უფრო მარტივია იმისთვისაა საჭირო, რომ კოდი უფრო მარტივად ჩავწეროთ

// thernary operatorისა და ifelses განსხვავებაა ის, რომ კოდი სხვანაირად ჩაიწერება და thernary უფრო მოკლეა მაგ . if - if(2 = 1) = 2 = 1?  else if -    else if (2 > 4){ } = : 2 > 4 ? else = else{} - : console.log("a") 


let userAge = 17;

userAge >= 18? console.log("სრულწლოვანი"): console.log("kid")


//  4) ახსენით რა არის helper function

// 5) რით განსხვავდება helper main function სგან

// helpერი ისეთი ფუნქცია არის  რომელსაც ჩვენ ვიყენებთ სხვა ფუნქციაში და მისი დანიშნულებაა, რომ მაინ ფუნქციას დაეხმაროს

// helpერი ფუნქცია იმისგან განსხვავდება mainისგან, რომ helpერს მაინის დასახმარებლად ვიყენებთ ხოლო მაინს საბოლო აუთპუტისთვის

