// # Homework

// 1) შექმენი სამი ცვლადი:

// balance (ამჟამინდელი ბალანსი, მაგ: 500)

// withdrawAmount (რამდენის გატანა სურს, მაგ: 600)

// isAccountActive (ბულიონი - აქტიურია თუ არა ბარათი, მაგ: true)

// ქეისი 1: თუ ანგარიში არააქტიურია (!isAccountActive) -> გამოიტანე: "ტრანზაქცია უარყოფილია: ბარათი დაბლოკილია."

// ქეისი 2: თუ გასატანი თანხა მეტია ბალანსზე -> გამოიტანე: "არასაკმარისი ნაშთი."

// ქეისი 3: თუ გასატანი თანხა ნაკლებია ან ტოლია 0-ზე -> გამოიტანე: "გთხოვთ, მიუთითოთ ვალიდური თანხა."

// ქეისი 4: თუ გასატანი თანხა ზუსტად ბალანსის ტოლია -> გამოიტანე: "ტრანზაქცია სრულდება. თქვენი ბალანსი ნულდება!"

// Default: ყველა სხვა შემთხვევაში (ანუ როცა თანხა საკმარისია და ბარათიც მუშაობს) -> გამოიტანე: "ტრანზაქცია წარმატებულია.".

balance = 500
draw = 450
active = true

if(!active){
    console.log("cant withdraw bc account is blocked")
}
else if(balance > draw){
    console.log(`your balance is ${balance - draw}`)
}
else if(balance < draw){
    console.log("cant withdraw bc your balance is lower than withdraw amount")
}
else{
    console.log("your balance is zero")
}


// 2) შექმენი Helper ფუნქცია isAllowed, რომელიც პარამეტრად მიიღებს ასაკს (age).

// ფუნქციის შიგნით გამოიყენე if/else:

// თუ ასაკი არის 18 ან მეტი, ფუნქციამ უნდა დააბრუნოს ტექსტი: "წვდომა დაშვებულია".

// თუ ნაკლებია, უნდა დააბრუნოს: "წვდომა აკრძალულია".

// შემდეგ შექმენი მასივი (ან უბრალოდ 3 ცვლადი) სხვადასხვა ასაკით (მაგ: 15, 20, 18).

// თითოეულისთვის გამოიძახე isAllowed და დაბეჭდე პასუხი.

function isAllowed(age){
    if(age >= 18){
        console.log("წვდომა დაშვებულია")
    }
    else{
        console.log("წვდომა აკრძალულია")
    }
}
isAllowed([21, 17, 10])