// # Homework

// 1. While Loop: "რიცხვების ჯამი"

// დავალება: დაწერე პროგრამა, რომელიც მომხმარებელს სთხოვს რიცხვების შეყვანას. პროგრამამ უნდა შეაჯამოს ეს რიცხვები მანამ, სანამ მომხმარებელი არ შეიყვანს 0-ს. როგორც კი მომხმარებელი შეიყვანს ნულს, პროგრამამ უნდა დაბეჭდოს საბოლოო ჯამი და შეწყვიტოს მუშაობა.

// 2. 2. For Loop: "გამრავლების ტაბულა"

// დავალება: მომხმარებელს შეაყვანინე ერთი კონკრეტული რიცხვი (მაგალითად, 7). პროგრამამ for ციკლის გამოყენებით უნდა დაბეჭდოს ამ რიცხვის გამრავლების ტაბულა 1-დან 10-მდე.

// 3. Do-While Loop: "პაროლის ვალიდაცია"

// დავალება: შექმენი "საიდუმლო პაროლი" (მაგ: "1234"). პროგრამამ მომხმარებელს უნდა სთხოვოს პაროლის შეყვანა. თუ პაროლი არასწორია, პროგრამამ კვლავ უნდა სთხოვოს მისი შეყვანა. do-while გამოიყენე იმისთვის, რომ კითხვა ("შეიყვანეთ პაროლი") ერთხელ მაინც დასვას და გაგრძელდეს მანამ, სანამ მომხმარებელი სწორ პასუხს არ დაწერს.

// 4. "რიცხვების ფილტრაცია"
// დავალება: for ციკლის გამოყენებით გაიარე რიცხვები 1-დან 50-მდე.

// თუ რიცხვი იყოფა 3-ზე, დაბეჭდე "Fizz".

// თუ რიცხვი იყოფა 5-ზე, დაბეჭდე "Buzz".

// თუ იყოფა ორივეზე, დაბეჭდე "FizzBuzz".

// სხვა შემთხვევაში დაბეჭდე თავად რიცხვი.


// 6. გადახედეთ ჩანაწერს

// 1.
let number = prompt("enter a number")
while(number = 0){
    let number = prompt("enter a number")
    let sum = number + 0
}
console.log(sum)
// 2.
let number1 = prompt("enter a number")
for(let i = 0; i < 11; i++){

    let I = i.toString()
    console.log(`${I}. ${number1*i}`)
    I = i.toString()
}
// 3.
do{
    input10 = prompt("enter a password")
    password = "password"
}while(input10 != password);
// 4.
for(let pigeon = 1; pigeon<51; pigeon++){
    if(pigeon % 3 === 0 && pigeon % 5 === 0){
        console.log("FizzBuzz")
    }
    else if(pigeon % 3 ===0){
        console.log("Fizz")
    }
    else if(pigeon % 5 === 0){
        console.log("Buzz")
    }
    else{
        console.log(pigeon)
    }

}
