// ახსენით რა განსხვავებაა ჩვეულებრივ ფუნქციასა და arrow ფუნციას შორის და მოიყვანე ერთი მაგალითი arrow ფუნქციაზე
// არროუ ფუნქციასა და ნორმალურის გან ისსაა განსხვავება, რომ არროუ უფრო მოკლედ იწერება და სხვანაირად

 
// # Classwork 

// 1) დაწერე ფუნქცია add, რომელიც ორ რიცხვს მიიღებს და მათ ჯამს დააბრუნებს.

// 2) შექმენი ფუნქცია square, რომელიც მიიღებს ერთ რიცხვს და დააბრუნებს მის კვადრატს (თავის თავზე ნამრავლს).

// 3) შექმენი ფუნქცია halfPrice, რომელიც მიიღებს ნივთის ფასს და დააბრუნებს მის ნახევარს.

// ყველა დავალება გააკეთეთ arrowFunction ით

const add = (num1, num2) => {num1 + num2}

const square = num3 => {num3 ** 3}

const halfprice = price => {price / 2}

console.log(add(1, 5))

console.log(square(5))
console.log(halfprice(10))