# listსა და setის განსხვავება არის. set არის უნორდერედი და setში დუპლიკატების შენახვა შეგვლილა პლიუს listში შეგვილია indexინგი გამოვიყენოთ, 
# სეტში არა

# set_nums= {8, 1, 7, 9, 0}
# set_nums.remove(1)
# set_nums.add(2)
# print(set_nums)

aboutme = {
   "name" : "davit",
   "phone" : "android",
   "age" : 11,
   "learns" : "programin/at GOA"
}

print(aboutme)

# .items = ყველაფერს იტანს მაგრამ თუპლის სტილით.
# .keys = გაომიტანს დიქშინარის ქეიებს.
# .get = ()-ში გადაეცემა რაცღაცა გასაღები და დიქშინარიდან .გვიბრუნებს მნიშმნელობას
# .items = ვარიუბლებს და კეიებს გამოიტანს დიქშინარიდან