# 0) კომენტარებით ახსენით რატომ იწყება ინდექსების ათვლა 0-იდან
# 1) შექმენით listი სახელად family სადაც შეინახავთ თქვენი ოჯახის წევრების სახელს

# იმიტომ იწყება ათვლა ნოლიდან, რომ ათვლა აქ სხივის ათვლას იყენებს.

family=["ლუიზა", "პაატა", "გიორგი", "ლია"]

# 2) კომენტარებითღ ახსეით რა არის mutable და immutable მონაცემთა ტიპები
# 3) წინა დავალებაში შექმნილი family ლისთიდან გამოიტანეთ ყველა ელემენტი ცალ-ცალკე

# mutable - მონაცემთა ტიპი რომლის შეცვლა შეგვიძლია ხოლო immutable რომლის არ შეგვიძლია
print(family[0])
print(family[1])
print(family[2])
print(family[3])