// 1)შექმენი სია სადაც შეინახავთ ნებისმიერ მონაცემთა ტიპის ელემენტს, შენი დავალებაა ამოიღო სიიდან ერთი რანმომული ელემენტი და გამოიტანო კონსოლში, მინიშნება: Math.random()
const list = [1, 2, 4, 5, 6, 6,9];
console.log(Math.random(1, list[8]));
// დავალება 2: ცვლადების შექმნა (let და const)
// ეს დავალება დაგეხმარება გაიგო სხვაობა let და const ცვლადებს შორის.

// შექმენი ცვლადი let-ის გამოყენებით შენი ასაკისთვის (მაგ: myAge) და მიანიჭე შესაბამისი რიცხვითი მნიშვნელობა.
let myAge = 12;
// შექმენი ცვლადი const-ის გამოყენებით შენი დაბადების წლისთვის (მაგ: birthYear) და მიანიჭე მნიშვნელობა.
const birthYear = 2014;
// ახლა სცადე შეცვალო myAge-ის მნიშვნელობა ახალი რიცხვით.
myAge = 13;
// გამოიტანე ორივე ცვლადი console.log()-ის დახმარებით.
console.log(myAge);
console.log(birthYear);
// ექსპერიმენტი: სცადე კოდში შეცვალო birthYear-ის მნიშვნელობაც. დააკვირდი რა შეცდომას (Error) გამოიტანს კონსოლი, რათა დარწმუნდე, რომ const-ის (მუდმივას) გადაწერა არ შეიძლება.
// birthYear = 12; // error


// დავალება 2: მათემატიკური მინიჭების ოპერატორები.
// გამოიყენე მოკლე ჩანაწერები (+=, -=, *=, /=).
let x = 5;
x+=1;
x-=2;
x*=10;
x/=5;
// წარმოიდგინე, რომ გაქვს საბანკო ანგარიში. შექმენი ცვლადი let balance = 100;
let balance = 100;
// ანგარიშზე ჩაგირიცხეს 50 ლარი. გაზარდე ბალანსი += ოპერატორის გამოყენებით.
balance+=50;
// მაღაზიაში დახარჯე 30 ლარი. შეამცირე ბალანსი -= ოპერატორის გამოყენებით.
balance-=30;
// შენი დარჩენილი ბალანსი გაორმაგდა (ბონუსი). გამოიყენე *= ოპერატორი.
balance*=2;
// დაბეჭდე საბოლოო balance კონსოლში.
console.log(balance);


// დავალება 3: ინკრემენტი და დეკრემენტი
// გავარჯიშდი ++ და -- ოპერატორებზე.

// შექმენი ცვლადი ვიდეოს "ლაიქებისთვის": let likes = 15;
let likes = 15;
// ვიღაცამ მოიწონა ვიდეო. გაზარდე likes ზუსტად 1-ით ინკრემენტის (++) გამოყენებით.
likes++
// ვიღაცამ წაშალა თავისი ლაიქი. შეამცირე likes 1-ით დეკრემენტის (--) გამოყენებით.
likes--
// გამოიტანე შედეგი კონსოლში ყოველი მოქმედების შემდეგ.
console.log(likes)


// დავალება 4: სტრიქონების შეერთება და ინტერპოლაცია.
// ისწავლე ტექსტისა და ცვლადების ერთმანეთთან დაკავშირება ორი სხვადასხვა მეთოდით.

// შექმენი 3 ცვლადი: firstName (შენი სახელი), lastName (შენი გვარი) და city (შენი ქალაქი).
const firstName ="davit";
const lastname = "dolidze"
const city = "tbilisi"

// Concatenation (+ ნიშნით): შექმენი ახალი ცვლადი greeting1 და დააკავშირე ეს ცვლადები ისე, რომ მიიღო წინადადება: "გამარჯობა, მე ვარ [სახელი] [გვარი] და ვცხოვრობ ქალაქ [ქალაქი]-ში." (არ დაგავიწყდეს სივრცეების (space) დამატება ბრჭყალებში).

let greet1 = "hello i am" + firstName+  " " + lastname + "and i live in" + " " + city
// Interpolation (უკუკვოტებით `` და ${}): შექმენი ახალი ცვლადი greeting2 და ზუსტად იგივე წინადადება ააწყვე Template Literals-ის გამოყენებით.
let greet2 = `hello i am ${firstName} ${lastname} and i live in ${city}`
// დაბეჭდე ორივე კონსოლში და დააკვირდი, რომელი სინტაქსი უფრო მოსახერხებელი და სუფთაა.
console.log(greet1)
console.log(greet2)