# 0) კომენტარებით ახსენით, რა არის ფუნქციები და რატომ ვიყენებთ მათ
# 1) შექმენით ფუნქცია სახელად "Printer", რომელიც გამოიტანს თქვენს სასურველ ტექსტს 3ჯერ. გამოიძახეთ ეს ფუნქცია 5ჯერ

# 0 ფუნქცია არის ბლოკი რომელშიც ინახება კოდები, მას ვიყენებთ რომ უფრო გავამარტივოთ მუშაობა და უფრო ნაკლები შეცდომა დავუშვათ.
# 1
def printer():
    print("I")
    print("like")
    print("GOA")

printer()
printer()
printer()
printer()
printer()


# 3 არგუმენტი არის defის შიგნით რომ იწერება რამე
# def sum(a, b):
#     return 3 + 7

# 4) შექმენით ფუნქცია სახელად difference, რომელსაც გადაეცემა სამი რიცხვი, შემდეგ გამოიტანეთ 
# ამ სამი რიცხვიდან ყველაზე დიდი და ყველაზე პატარა რიცხვი

list = []
def difference (a, b, c):
    return 7, 8, 10
list.append(7)
list.append(8)
list.append(10)
print(min(list))
print(max(list))



   
 
 

     