# 1) შექმენით ერთი list, სადაც გექნებაც მოცემული ინტეჯერი რიცხვები მოცემული 1 დან 12მდე, თქვენი დავალებაა რომ გააორმაგოთ თითოეული რიცხვი თითოეულ იტერაციაზე



# 2) list comprehension დროს დაატრიალეთ for loop და დააგენერირეთ რიცხვები 0 დან 20 მდე



# 3) შექმენით ერთი ლისთი ხილზე, და გაფილტრეთ იმ ხილის სახელები რომლებიც არ იწყება "A" ზე



# 4) შექმენით ერთი ინტეჯერების list სადაც გექნებათ მოცემული რიცხვები 1 დან 20 მდე, თქვენი დავალებაა რომ გაფილტროთ კენტი რიცხვები list comprehension გამოყენებით

# 1)
nums = [x*2 for x in range(1, 13)]
print(nums)

nums1 = [x for x in range(0, 20)]
print(nums1)

furits = ["apple", "avocado", "watermelon", "kiwi"]
fruits = [x for x in furits if x == "A"]
print(fruits)

nums2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
nums3 = [x for x in nums2 if x % 2 == 0]
print(nums3)